nc: 80  # počet tried
depth_multiple: 0.33
width_multiple: 0.50
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# Backbone s ECA
backbone:
  [[-1, 1, Focus, [64, 3]],          #0-P1/2
   [-1, 1, Conv, [128, 3, 2]],       #1-P2/4
   [-1, 3, C3, [128]],               #2
   [-1, 1, ECALayer, [128]],         #3 (ECA1)

   [-1, 1, Conv, [256, 3, 2]],       #4-P3/8
   [-1, 6, C3, [256]],               #5
   [-1, 1, ECALayer, [256]],         #6 (ECA2)

   [-1, 1, Conv, [512, 3, 2]],       #7-P4/16
   [-1, 9, C3, [512]],               #8
   [-1, 1, ECALayer, [512]],         #9 (ECA3)

   [-1, 1, Conv, [1024, 3, 2]],      #10-P5/32
   [-1, 3, C3, [1024]],              #11
   [-1, 1, SPPF, [1024, 5]],         #12 (SPPF)
   [-1, 1, ECALayer, [1024]],        #13 (ECA4)
  ]

# Head s BiFPN concat 2/3
head:
  [[-1, 1, Conv, [512, 1, 1]],                      #14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],       #15
   [[-1, 9], 1, BiFPN_Concat2, [1]],                #16 ← ECA3 (vrstva 9) + P5
   [-1, 3, C3, [512, False]],                       #17

   [-1, 1, Conv, [256, 1, 1]],                      #18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],       #19
   [[-1, 6], 1, BiFPN_Concat2, [1]],                #20 ← ECA2 (vrstva 6) + P4
   [-1, 3, C3, [256, False]],                       #21

   [-1, 1, Conv, [256, 3, 2]],                      #22
   [[-1, 17, 9], 1, BiFPN_Concat3, [1]],            #23 ← P3 + ECA3 + P4
   [-1, 3, C3, [512, False]],                       #24

   [-1, 1, Conv, [512, 3, 2]],                      #25
   [[-1, 13], 1, BiFPN_Concat2, [1]],               #26 ← ECA4 (vrstva 13) + P5
   [-1, 3, C3, [1024, False]],                      #27

   [[21, 24, 27], 1, Detect, [nc, anchors]],        # Detect(P3, P4, P5)
  ]